{
  "author": [
    {
      "author": "Douglas Adams", 
      "description": "Douglas Noël Adams was an English author, comic radio dramatist, and musician. He is best known as the author of the <i>\n  <a href=\"https://www.goodreads.com/book/show/11.Hitchhiker_s_Guide_to_the_Galaxy\" title=\"Hitchhiker's Guide to the Galaxy\" rel=\"nofollow\">Hitchhiker's Guide to the Galaxy</a>\n</i> series. Hitchhiker's began on radio, and developed into a \"trilogy\" of five books (which sold more than fifteen million copies during his lifetime) as well as a television series, a comic book series, a computer game, and a feature film that was completed after Adams' death. The series has also been adapted for live theatre using various scripts; the earliest such productions used material newly written by Adams. He was known to some fans as Bop Ad (after his illegible signature), or by his initials \"DNA\".<br /><br />In addition to <i>The Hitchhiker's Guide to the Galaxy</i>, Douglas Adams wrote or co-wrote three stories of the science fiction television series Doctor Who and served as Script Editor during the seventeenth season. His other written works include the Dirk Gently novels, and he co-wrote two Liff books and <i>Last Chance to See</i>, itself based on a radio series. Adams also originated the idea for the computer game <i>Starship Titanic</i>, which was produced by a company that Adams co-founded, and adapted into a novel by Terry Jones. A posthumous collection of essays and other material, including an incomplete novel, was published as <i>\n  <a href=\"https://www.goodreads.com/book/show/359.The_Salmon_of_Doubt\" title=\"The Salmon of Doubt\" rel=\"nofollow\">The Salmon of Doubt</a>\n</i> in 2002.<br /><br />His fans and friends also knew Adams as an environmental activist and a lover of fast cars, cameras, the Macintosh computer, and other \"techno gizmos\". <br /><br />Toward the end of his life he was a sought-after lecturer on topics including technology and the environment.", 
      "hometown": "Cambridge, England", 
      "id": 4, 
      "large_img": "https://images.gr-assets.com/authors/1189120061p5/4.jpg", 
      "small_img": "https://images.gr-assets.com/authors/1189120061p2/4.jpg"
    }, 
    {
      "author": "Bill Bryson", 
      "description": "William McGuire \"Bill\" Bryson, OBE, FRS<br /><br />Bill Bryson was born in Des Moines, Iowa, in 1951. He settled in England in 1977, and worked in journalism until he became a full time writer. He lived for many years with his English wife and four children in North Yorkshire. He and his family then moved to New Hampshire in America for a few years, but they have now returned to live in the UK.<br /><br />In <i>The Lost Continent</i>, Bill Bryson's hilarious first travel book, he chronicled a trip in his mother's Chevy around small town America. It was followed by <i>Neither Here Nor There</i>, an account of his first trip around Europe. Other travel books include the massive bestseller <i>Notes From a Small Island</i>, which won the 2003 World Book Day National Poll to find the book which best represented modern England, followed by <i>A Walk in the Woods</i> (in which Stephen Katz, his travel companion from <i>Neither Here Nor There</i>, made a welcome reappearance), <i>Notes From a Big Country</i> and <i>Down Under</i>.<br /><br />Bill Bryson has also written several highly praised books on the English language, including <i>Mother Tongue</i> and <i>Made in America</i>. In his last book, he turned his attention to science. <i>A Short History of Nearly Everything</i> was lauded with critical acclaim, and became a huge bestseller. It was shortlisted for the Samuel Johnson Prize, before going on to win the Aventis Prize for Science Books and the Descartes Science Communication Prize. His next book, <i>The Life and Times of the Thunderbolt Kid</i>, is a memoir of growing up in 1950s America, featuring another appearance from his old friend Stephen Katz. October 8 sees the publication of <i>A Really Short History of Nearly Everything<i>.</i></i>", 
      "hometown": "Des Moines, Polk County, Iowa", 
      "id": 7, 
      "large_img": "https://images.gr-assets.com/authors/1189096502p5/7.jpg", 
      "small_img": "https://images.gr-assets.com/authors/1189096502p2/7.jpg"
    }, 
    {
      "author": "James Hamilton-Paterson", 
      "description": "James Hamilton-Paterson's work has been translated into many languages. He is a highly acclaimed author of non-fiction books, including Seven-Tenths, Three Miles Down and Playing with Water, as well as America's Boy, a study of Ferdinand Marcos and the Philippines. Gerontius, his first novel, won the Whitbread Award, while his most recent, Loving Monsters (2001), was praised by the Sunday Telegraph as 'tantalising, erudite and ingenious'. He lives in Italy.", 
      "hometown": "London", 
      "id": 12, 
      "large_img": "https://images.gr-assets.com/authors/1270517383p5/12.jpg", 
      "small_img": "https://images.gr-assets.com/authors/1270517383p2/12.jpg"
    }, 
    {
      "author": "Dave Thomas", 
      "description": null, 
      "hometown": null, 
      "id": 13, 
      "large_img": "https://s.gr-assets.com/assets/nophoto/user/m_200x266-d279b33f8eec0f27b7272477f09806be.png", 
      "small_img": "https://s.gr-assets.com/assets/nophoto/user/m_50x66-82093808bca726cb3249a493fbd3bd0f.png"
    }, 
    {
      "author": "Edith Wharton", 
      "description": "Edith Newbold Jones was born into such wealth and privilege that her family inspired the phrase \"keeping up with the Joneses.\" The youngest of three children, Edith spent her early years touring Europe with her parents and, upon the family's return to the United States, enjoyed a privileged childhood in New York and Newport, Rhode Island. Edith's creativity and talent soon became obvious: By the age of eighteen she had written a novella, (as well as witty reviews of it) and published poetry in the Atlantic Monthly.<br /><br />After a failed engagement, Edith married a wealthy sportsman, Edward Wharton. Despite similar backgrounds and a shared taste for travel, the marriage was not a success. Many of Wharton's novels chronicle unhappy marriages, in which the demands of love and vocation often conflict with the expectations of society. Wharton's first major novel, <i>The House of Mirth,</i> published in 1905, enjoyed considerable literary success. <i>Ethan Frome</i> appeared six years later, solidifying Wharton's reputation as an important novelist. Often in the company of her close friend, Henry James, Wharton mingled with some of the most famous writers and artists of the day, including F. Scott Fitzgerald, André Gide, Sinclair Lewis, Jean Cocteau, and Jack London.<br /><br />In 1913 Edith divorced Edward. She lived mostly in France for the remainder of her life. When World War I broke out, she organized hostels for refugees, worked as a fund-raiser, and wrote for American publications from battlefield frontlines. She was awarded the French Legion of Honor for her courage and distinguished work.<br /><br /><i>The Age of Innocence,</i> a novel about New York in the 1870s, earned Wharton the Pulitzer Prize for fiction in 1921 -- the first time the award had been bestowed upon a woman. Wharton traveled throughout Europe to encourage young authors. She also continued to write, lying in her bed every morning, as she had always done, dropping each newly penned page on the floor to be collected and arranged when she was finished. Wharton suffered a stroke and died on August 11, 1937. She is buried in the American Cemetery in Versailles, France. <br /><i>- Barnesandnoble.com</i>", 
      "hometown": "New York City, NY", 
      "id": 16, 
      "large_img": "https://images.gr-assets.com/authors/1484512230p5/16.jpg", 
      "small_img": "https://images.gr-assets.com/authors/1484512230p2/16.jpg"
    }, 
    {
      "author": "Gary Paulsen", 
      "description": "Although he was never a dedicated student, Paulsen developed a passion for reading at an early age. After a librarian gave him a book to read--along with his own library card--he was hooked. He began spending hours alone in the basement of his apartment building, reading one book after another. <br /><br />Running away from home at the age of 14 and traveling with a carnival, Paulsen acquired a taste for adventure. A youthful summer of rigorous chores on a farm; jobs as an engineer, construction worker, ranch hand, truck driver, and sailor; and two rounds of the 1,180-mile Alaskan dog sled race, the Iditarod; have provided ample material from which he creates his stories.<br /><br />Paulsen and his wife, Ruth Wright Paulsen, an artist who has illustrated several of his books, divide their time between a home in New Mexico and a boat in the Pacific.<br />", 
      "hometown": "Minneapolis, Minnesota", 
      "id": 18, 
      "large_img": "https://images.gr-assets.com/authors/1309159225p5/18.jpg", 
      "small_img": "https://images.gr-assets.com/authors/1309159225p2/18.jpg"
    }, 
    {
      "author": "Zilpha Keatley Snyder", 
      "description": "The recipient of three Newbery Honor Book awards for \"The Egypt Game,\" \"The Headless Cupid,\" and \"The Witches of Worm,\" Zilpha Keatley Snyder began writing books for children in 1964 when her first book, \"A Season of Ponies,\" was published. Over the course of the career she completed 43 books, mostly for children aged 9 to 13, but also including two books for young adults, four picture books for younger children and a book of poetry.", 
      "hometown": "Lemoore, California", 
      "id": 27, 
      "large_img": "https://images.gr-assets.com/authors/1210708950p5/27.jpg", 
      "small_img": "https://images.gr-assets.com/authors/1210708950p2/27.jpg"
    }, 
    {
      "author": "Edward P. Jones", 
      "description": "Edward P. Jones has won the Pulitzer Prize, the National Book Critics Circle Award, the International IMPAC Dublin Literary Award, and the Lannan Literary Award for <i>The Known World</i>. He received a MacArthur Fellowship in 2004, and his first collection of short stories, <i>Lost in the City</i>, won the PEN/Hemingway Award and was short-listed for the National Book Award. His most recent collection, <i>All Aunt Hagar's Children</i>, has become a bestseller.", 
      "hometown": "Washington, District of Columbia", 
      "id": 33, 
      "large_img": "https://images.gr-assets.com/authors/1206505071p5/33.jpg", 
      "small_img": "https://images.gr-assets.com/authors/1206505071p2/33.jpg"
    }, 
    {
      "author": "Johanna Spyri", 
      "description": "Johanna Spyri was an author of children's stories, and is best known for <i>Heidi</i>. Born Johanna Louise Heusser in the rural area of Hirzel, Switzerland, as a child she spent several summers in the area around Chur in Graubünden, the setting she later would use in her novels.<br /><br />Johanna Spyri geb. Heusser. Die Tochter eines Arztes und einer pietistischen Lyrikerin wuchs als viertes von sechs Kindern in einem Landarzthaushalt auf. Nach der Dorfschule und Privatunterricht beim Pfarrer erhielt sie in Zürich drei Jahre Fremdsprachen- und Musikunterricht, kam dann für ein Jahr nach Yverdon (Neuenburger See) in ein Pensionat. Ab 1845 unterrichtete sie zu Hause ihre jüngeren Schwestern und trieb autodidaktische Literaturstudien. Nach der Heirat mit dem Juristen (später Stadtschreiber) Bernhard Spyri zog sie 1852 nach Zürich.", 
      "hometown": "Hirzel", 
      "id": 49, 
      "large_img": "https://images.gr-assets.com/authors/1201029829p5/49.jpg", 
      "small_img": "https://images.gr-assets.com/authors/1201029829p2/49.jpg"
    }, 
    {
      "author": "Frank Herbert", 
      "description": "Frank Herbert was a critically acclaimed and commercially successful American science fiction author.<br /><br />He is best known for the novel <i>Dune</i> and its five sequels. The Dune saga, set in the distant future and taking place over millennia, dealt with themes such as human survival and evolution, ecology, and the intersection of religion, politics, and power, and is widely considered to be among the classics in the field of science fiction.<br /><br />He was the father of fellow author <a href=\"https://www.goodreads.com/author/show/56.Brian_Herbert\" title=\"Brian Herbert\" rel=\"nofollow\">Brian Herbert</a>.", 
      "hometown": "Tacoma, Washington", 
      "id": 58, 
      "large_img": "https://images.gr-assets.com/authors/1168661521p5/58.jpg", 
      "small_img": "https://images.gr-assets.com/authors/1168661521p2/58.jpg"
    }, 
    {
      "author": "Isabel Allende", 
      "description": "Isabel Allende Llona is a Chilean-American novelist. Allende, who writes in the \"magic realism\" tradition, is considered one of the first successful women novelists in Latin America. She has written novels based in part on her own experiences, often focusing on the experiences of women, weaving myth and realism together. She has lectured and done extensive book tours and has taught literature at several US colleges. She currently resides in California with her husband. Allende adopted U.S. citizenship in 2003.<br /><br />", 
      "hometown": "Lima", 
      "id": 2238, 
      "large_img": "https://images.gr-assets.com/authors/1341879973p5/2238.jpg", 
      "small_img": "https://images.gr-assets.com/authors/1341879973p2/2238.jpg"
    }, 
    {
      "author": "August Hahn", 
      "description": null, 
      "hometown": null, 
      "id": 10470, 
      "large_img": "https://s.gr-assets.com/assets/nophoto/user/u_200x266-e183445fd1a1b5cc7075bb1cf7043306.png", 
      "small_img": "https://s.gr-assets.com/assets/nophoto/user/u_50x66-632230dc9882b4352d753eedf9396530.png"
    }, 
    {
      "author": "Helen Nader", 
      "description": null, 
      "hometown": null, 
      "id": 109445, 
      "large_img": "https://s.gr-assets.com/assets/nophoto/user/u_200x266-e183445fd1a1b5cc7075bb1cf7043306.png", 
      "small_img": "https://s.gr-assets.com/assets/nophoto/user/u_50x66-632230dc9882b4352d753eedf9396530.png"
    }, 
    {
      "author": "Earl B. McElfresh", 
      "description": "Earl B. McElfresh (St. Lawrence University) is the author of Sidereal Days, The History of Rock &amp; Roll, A Romance (Tammy Norie Press e-book 2012,) Maps and Mapmakers of the Civil War (Abrams, 1999) and contributing editor to Company Commander by Charles B. MacDonald (History Book Club, 2007.) He is a regular contributor of Civil War articles to Civil War Times Magazine. <br /><br />He has spoken on Civil War mapping at The Smithsonian, The National Archives, The Library of Congress, The New York Public Library, The Boston Public Library, The Newberry Library, The Harvard Map Collection, The Warburg Institute in London, National Geographic and on C-Span Book TV. <br /><br />His plays Marvels of Modern Man and Amid Planetary Music were performed at St. Lawrence University. His play Honor Luck received a reading at the New Phoenix Theater in Buffalo. His screenplay Lazy Eye was filmed and premiered at the New School in New York. <br /><br />Cartographer for McElfresh Map Company LLC, he has prepared twenty-three maps. Twenty of the maps have been main or featured selections of History Book Club. He is currently preparing endpaper maps for the four volume Civil War set being being published by Library of America and entitled The Civil War: Told by Those Who Lived It.<br /><br />He served two years in Olean (NY) city government on the Common Council—a great experience—and he played rhythm guitar with the band The Fabtones. The cabaret laws of New York City pretty much restricted their playing to the wonderfully hospitable streets of New York City. <br /><br />He and his wife Michiko have three children and a cat. Like Roger Miller’s King of the Road, they have no pool.", 
      "hometown": null, 
      "id": 142388, 
      "large_img": "https://images.gr-assets.com/authors/1346955400p5/142388.jpg", 
      "small_img": "https://images.gr-assets.com/authors/1346955400p2/142388.jpg"
    }, 
    {
      "author": "Pete Mitchell", 
      "description": null, 
      "hometown": null, 
      "id": 441822, 
      "large_img": "https://s.gr-assets.com/assets/nophoto/user/u_200x266-e183445fd1a1b5cc7075bb1cf7043306.png", 
      "small_img": "https://s.gr-assets.com/assets/nophoto/user/u_50x66-632230dc9882b4352d753eedf9396530.png"
    }, 
    {
      "author": "Paul H. Rubin", 
      "description": null, 
      "hometown": null, 
      "id": 441975, 
      "large_img": "https://s.gr-assets.com/assets/nophoto/user/u_200x266-e183445fd1a1b5cc7075bb1cf7043306.png", 
      "small_img": "https://s.gr-assets.com/assets/nophoto/user/u_50x66-632230dc9882b4352d753eedf9396530.png"
    }, 
    {
      "author": "Syd Kyle-Little", 
      "description": null, 
      "hometown": null, 
      "id": 520123, 
      "large_img": "https://s.gr-assets.com/assets/nophoto/user/u_200x266-e183445fd1a1b5cc7075bb1cf7043306.png", 
      "small_img": "https://s.gr-assets.com/assets/nophoto/user/u_50x66-632230dc9882b4352d753eedf9396530.png"
    }, 
    {
      "author": "J.R.R. Tolkien", 
      "description": "John Ronald Reuel Tolkien, CBE, was an English writer, poet, WWI veteran (a First Lieutenant in the Lancashire Fusiliers, British Army), philologist, and university professor, best known as the author of the high fantasy classic works <i>\n  <a href=\"https://www.goodreads.com/book/show/5907.The_Hobbit\" title=\"The Hobbit\" rel=\"nofollow\">The Hobbit</a>\n</i> and <i>\n  <a href=\"https://www.goodreads.com/book/show/33.The_Lord_of_the_Rings\" title=\"The Lord of the Rings\" rel=\"nofollow\">The Lord of the Rings</a>\n</i>.<br /><br />Tolkien was Rawlinson and Bosworth Professor of Anglo-Saxon at Oxford from 1925 to 1945, and Merton Professor of English language and literature from 1945 to 1959. He was a close friend of <a href=\"https://www.goodreads.com/author/show/1069006.C_S__Lewis\" title=\"C.S. Lewis\" rel=\"nofollow\">C.S. Lewis</a>.<br /><br /><a href=\"https://www.goodreads.com/author/show/9533.Christopher_Tolkien\" title=\"Christopher Tolkien\" rel=\"nofollow\">Christopher Tolkien</a> published a series of works based on his father's extensive notes and unpublished manuscripts, including <i>\n  <a href=\"https://www.goodreads.com/book/show/7332.The_Silmarillion\" title=\"The Silmarillion\" rel=\"nofollow\">The Silmarillion</a>\n</i>. These, together with <i>The Hobbit</i> and <i>The Lord of the Rings</i>, form a connected body of tales, poems, fictional histories, invented languages, and literary essays about an imagined world called Arda, and Middle-earth within it. Between 1951 and 1955, Tolkien applied the word \"legendarium\" to the larger part of these writings. <br /><br />While many other authors had published works of fantasy before Tolkien, the great success of <i>The Hobbit</i> and <i>The Lord of the Rings</i> led directly to a popular resurgence of the genre. This has caused Tolkien to be popularly identified as the \"father\" of modern fantasy literature—or more precisely, high fantasy. Tolkien's writings have inspired many other works of fantasy and have had a lasting effect on the entire field.<br /><br />In 2008, <i>The Times</i> ranked him sixth on a list of \"The 50 greatest British writers since 1945\". <i>Forbes</i> ranked him the 5th top-earning dead celebrity in 2009.<br /><br /><b>Religious influences</b><br />J.R.R. Tolkien, was born in South Africa in 1892, but his family moved to Britain when he was about 3 years old. When Tolkien was 8 years old, his mother converted to Catholicism, and he remained a Catholic throughout his life. In his last interview, two years before his death, he unhesitatingly testified, “I’m a devout Roman Catholic.” <br /><br />Tolkien married his childhood sweetheart, Edith, and they had four children. He wrote them letters each year as if from Santa Claus, and a selection of these was published in 1976 as <i>\n  <a href=\"https://www.goodreads.com/book/show/7331.The_Father_Christmas_Letters\" title=\"The Father Christmas Letters\" rel=\"nofollow\">The Father Christmas Letters</a>\n</i>. One of Tolkien’s sons became a Catholic priest. Tolkien was an advisor for the translation of the <i>\n  <a href=\"https://www.goodreads.com/book/show/108930.Jerusalem_Bible\" title=\"Jerusalem Bible\" rel=\"nofollow\">Jerusalem Bible</a>\n</i>. <br /><br />Tolkien once described <i>The Lord of the Rings</i> to his friend Robert Murray, an English Jesuit priest, as \"a fundamentally religious and Catholic work, unconsciously so at first, but consciously in the revision.\" There are many theological themes underlying the narrative including the battle of good versus evil, the triumph of humility over pride, and the activity of grace. In addition the saga includes themes which incorporate death and immortality, mercy and pity, resurrection, salvation, repentance, self-sacrifice, free will, justice, fellowship, authority and healing. In addition <i>The Lord's Prayer</i> \"And lead us not into temptation, but deliver us from evil\" was reportedly present in Tolkien's mind as he described Frodo's struggles against the power of the \"One Ring.''", 
      "hometown": "Bloemfontein, Mangaung, Free State", 
      "id": 656983, 
      "large_img": "https://images.gr-assets.com/authors/1434625177p5/656983.jpg", 
      "small_img": "https://images.gr-assets.com/authors/1434625177p2/656983.jpg"
    }, 
    {
      "author": "J.K. Rowling", 
      "description": "See also: <a href=\"https://www.goodreads.com/author/show/383606.Robert_Galbraith\" title=\"Robert Galbraith\" rel=\"nofollow\">Robert Galbraith</a><br />Although she writes under the pen name <b>J.K. Rowling</b>, pronounced like <i>rolling</i>, her name when her first <i>Harry Potter</i> book was published was simply <b>Joanne Rowling</b>. Anticipating that the target audience of young boys might not want to read a book written by a woman, her publishers demanded that she use two initials, rather than her full name. As she had no middle name, she chose <b>K</b> as the second initial of her pen name, from her paternal grandmother Kathleen Ada Bulgen Rowling. She calls herself <b>Jo</b> and has said, \"No one ever called me 'Joanne' when I was young, unless they were angry.\" Following her marriage, she has sometimes used the name <b>Joanne Murray</b> when conducting personal business. During the Leveson Inquiry she gave evidence under the name of <b>Joanne Kathleen Rowling</b>. In a 2012 interview, Rowling noted that she no longer cared that people pronounced her name incorrectly.<br /><br />Rowling was born to Peter James Rowling, a Rolls-Royce aircraft engineer, and Anne Rowling (née Volant), on 31 July 1965 in Yate, Gloucestershire, England, 10 miles (16 km) northeast of Bristol. Her mother Anne was half-French and half-Scottish. Her parents first met on a train departing from King's Cross Station bound for Arbroath in 1964. They married on 14 March 1965. Her mother's maternal grandfather, Dugald Campbell, was born in Lamlash on the Isle of Arran. Her mother's paternal grandfather, Louis Volant, was awarded the Croix de Guerre for exceptional bravery in defending the village of Courcelles-le-Comte during the First World War.<br /><br />Rowling's sister Dianne was born at their home when Rowling was 23 months old. The family moved to the nearby village Winterbourne when Rowling was four. She attended St Michael's Primary School, a school founded by abolitionist William Wilberforce and education reformer Hannah More. Her headmaster at St Michael's, Alfred Dunn, has been suggested as the inspiration for the <i>Harry Potter</i> headmaster Albus Dumbledore.<br /><br />As a child, Rowling often wrote fantasy stories, which she would usually then read to her sister. She recalls that: \"I can still remember me telling her a story in which she fell down a rabbit hole and was fed strawberries by the rabbit family inside it. Certainly the first story I ever wrote down (when I was five or six) was about a rabbit called Rabbit. He got the measles and was visited by his friends, including a giant bee called Miss Bee.\" At the age of nine, Rowling moved to Church Cottage in the Gloucestershire village of Tutshill, close to Chepstow, Wales. When she was a young teenager, her great aunt, who Rowling said \"taught classics and approved of a thirst for knowledge, even of a questionable kind,\" gave her a very old copy of Jessica Mitford's autobiography, <i>Hons and Rebels</i>. Mitford became Rowling's heroine, and Rowling subsequently read all of her books.<br /><br />Rowling has said of her teenage years, in an interview with The New Yorker, \"I wasn’t particularly happy. I think it’s a dreadful time of life.\" She had a difficult homelife; her mother was ill and she had a difficult relationship with her father (she is no longer on speaking terms with him). She attended secondary school at Wyedean School and College, where her mother had worked as a technician in the science department. Rowling said of her adolescence, \"Hermione [a bookish, know-it-all <i>Harry Potter</i> character] is loosely based on me. She's a caricature of me when I was eleven, which I'm not particularly proud of.\" Steve Eddy, who taught Rowling English when she first arrived, remembers her as \"not exceptional\" but \"one of a group of girls who were bright, and quite good at English.\" Sean Harris, her best friend in the Upper Sixth owned a turquoise Ford Anglia, which she says inspired the one in her books.", 
      "hometown": "Yate, South Gloucestershire, England", 
      "id": 1077326, 
      "large_img": "https://images.gr-assets.com/authors/1415945171p5/1077326.jpg", 
      "small_img": "https://images.gr-assets.com/authors/1415945171p2/1077326.jpg"
    }
  ], 
  "books": [
    {
      "description": "The war against Voldemort is not going well: even Muggle governments are noticing. Ron scans the obituary pages of The Daily Prophet looking for familiar names. Dumbledore is absent from Hogwarts for long stretches of time, and the Order of the Phoenix has already suffered losses. And yet... As in all wars, life goes on. Sixth-year students learn to Apparate, and lose a few eyebrows in the process. The Weasley twins expand their business. Teenagers flirt and fight and fall in love. Classes are never straightforward, though Harry receives some extraordinary help from the mysterious Half-Blood Prince. So it's the home front that takes center stage in the multilayered sixth installment of the story of Harry Potter. Harry struggles to uncover the identity of the Half-Blood Prince, the past owner of a potions textbook he now possesses that is filled with ingenious, potentially deadly, spells. But Harry's life is suddenly changed forever when someone close to him is heinously murdered right before his eyes. With Dumbledore's guidance, he seeks out the full, complex story of the boy who became Lord Voldemort, and thereby attempts to find what may be his only vulnerability.<br />--scholastic.com", 
      "id": 1, 
      "large_img": "https://images.gr-assets.com/books/1361039191m/1.jpg", 
      "list": null, 
      "published_date": "9", 
      "rating": 4.54, 
      "series_id": null, 
      "small_img": "https://images.gr-assets.com/books/1361039191s/1.jpg", 
      "title": "Harry Potter and the Half-Blood Prince (Harry Potter, #6)"
    }, 
    {
      "description": "Harry Potter is due to start his fifth year at Hogwarts School of Witchcraft and Wizardry. His best friends Ron and Hermione have been very secretive all summer and he is desperate to get back to school and find out what has been going on. However, what Harry discovers is far more devastating than he could ever have expected...<br /><br />Suspense, secrets and thrilling action from the pen of J.K. Rowling ensure an electrifying adventure that is impossible to put down.", 
      "id": 2, 
      "large_img": "https://images.gr-assets.com/books/1507396732m/2.jpg", 
      "list": null, 
      "published_date": "8", 
      "rating": 4.47, 
      "series_id": null, 
      "small_img": "https://images.gr-assets.com/books/1507396732s/2.jpg", 
      "title": "Harry Potter and the Order of the Phoenix (Harry Potter, #5)"
    }, 
    {
      "description": "Harry Potter's life is miserable. His parents are dead and he's stuck with his heartless relatives, who force him to live in a tiny closet under the stairs. But his fortune changes when he receives a letter that tells him the truth about himself: he's a wizard. A mysterious visitor rescues him from his relatives and takes him to his new home, Hogwarts School of Witchcraft and Wizardry.<br /><br />After a lifetime of bottling up his magical powers, Harry finally feels like a normal kid. But even within the Wizarding community, he is special. He is the boy who lived: the only person to have ever survived a killing curse inflicted by the evil Lord Voldemort, who launched a brutal takeover of the Wizarding world, only to vanish after failing to kill Harry.<br /><br />Though Harry's first year at Hogwarts is the best of his life, not everything is perfect. There is a dangerous secret object hidden within the castle walls, and Harry believes it's his responsibility to prevent it from falling into evil hands. But doing so will bring him into contact with forces more terrifying than he ever could have imagined.<br /><br />Full of sympathetic characters, wildly imaginative situations, and countless exciting details, the first installment in the series assembles an unforgettable magical world and sets the stage for many high-stakes adventures to come.", 
      "id": 3, 
      "large_img": "https://images.gr-assets.com/books/1474154022m/3.jpg", 
      "list": null, 
      "published_date": "6", 
      "rating": 4.45, 
      "series_id": null, 
      "small_img": "https://images.gr-assets.com/books/1474154022s/3.jpg", 
      "title": "Harry Potter and the Sorcerer's Stone"
    }, 
    {
      "description": "The Dursleys were so mean and hideous that summer that all Harry Potter wanted was to get back to the Hogwarts School for Witchcraft and Wizardry. But just as he's packing his bags, Harry receives a warning from a strange, impish creature named Dobby who says that if Harry Potter returns to Hogwarts, disaster will strike.<br /><br />And strike it does. For in Harry's second year at Hogwarts, fresh torments and horrors arise, including an outrageously stuck-up new professor, Gilderoy Lockhart, a spirit named Moaning Myrtle who haunts the girls' bathroom, and the unwanted attentions of Ron Weasley's younger sister, Ginny. But each of these seem minor annoyances when the real trouble begins, and someone, or something, starts turning Hogwarts students to stone. Could it be Draco Malfoy, a more poisonous rival than ever? Could it possibly be Hagrid, whose mysterious past is finally told? Or could it be the one everyone at Hogwarts most suspects: Harry Potter himself?", 
      "id": 4, 
      "large_img": "https://images.gr-assets.com/books/1474154604m/4.jpg", 
      "list": null, 
      "published_date": "11", 
      "rating": 4.38, 
      "series_id": null, 
      "small_img": "https://images.gr-assets.com/books/1474154604s/4.jpg", 
      "title": "Harry Potter and the Chamber of Secrets (Harry Potter, #2)"
    }, 
    {
      "description": "Harry Potter's third year at Hogwarts is full of new dangers. A convicted murderer, Sirius Black, has broken out of Azkaban prison, and it seems he's after Harry. Now Hogwarts is being patrolled by the dementors, the Azkaban guards who are hunting Sirius. But Harry can't imagine that Sirius or, for that matter, the evil Lord Voldemort could be more frightening than the dementors themselves, who have the terrible power to fill anyone they come across with aching loneliness and despair. Meanwhile, life continues as usual at Hogwarts. A top-of-the-line broom takes Harry's success at Quidditch, the sport of the Wizarding world, to new heights. A cute fourth-year student catches his eye. And he becomes close with the new Defense of the Dark Arts teacher, who was a childhood friend of his father. Yet despite the relative safety of life at Hogwarts and the best efforts of the dementors, the threat of Sirius Black grows ever closer. But if Harry has learned anything from his education in wizardry, it is that things are often not what they seem. Tragic revelations, heartwarming surprises, and high-stakes magical adventures await the boy wizard in this funny and poignant third installment of the beloved series.<br />--scholastic.com", 
      "id": 5, 
      "large_img": "https://images.gr-assets.com/books/1499277281m/5.jpg", 
      "list": null, 
      "published_date": "5", 
      "rating": 4.53, 
      "series_id": null, 
      "small_img": "https://images.gr-assets.com/books/1499277281s/5.jpg", 
      "title": "Harry Potter and the Prisoner of Azkaban (Harry Potter, #3)"
    }, 
    {
      "description": "Harry Potter is midway through his training as a wizard and his coming of age. Harry wants to get away from the pernicious Dursleys and go to the International Quidditch Cup. He wants to find out about the mysterious event that's supposed to take place at Hogwarts this year, an event involving two other rival schools of magic, and a competition that hasn't happened for a hundred years. He wants to be a normal, fourteen-year-old wizard. But unfortunately for Harry Potter, he's not normal - even by wizarding standards. <br /><br />And in his case, different can be deadly.<br />--back cover", 
      "id": 6, 
      "large_img": "https://images.gr-assets.com/books/1361482611m/6.jpg", 
      "list": null, 
      "published_date": "9", 
      "rating": 4.53, 
      "series_id": null, 
      "small_img": "https://images.gr-assets.com/books/1361482611s/6.jpg", 
      "title": "Harry Potter and the Goblet of Fire (Harry Potter, #4)"
    }, 
    {
      "description": "<b>The Hitchhiker's Guide to the Galaxy:</b><br />Seconds before the Earth is demolished to make way for a galactic freeway, Arthur Dent is plucked off the planet by his friend Ford Prefect, a researcher for the revised edition of The Hitchhiker's Guide to the Galaxy who, for the last fifteen years, has been posing as an out-of-work actor.<p>Together this dynamic pair begin a journey through space aided by quotes from The Hitchhiker's Guide (\"A towel is about the most massively useful thing an interstellar hitchhiker can have\") and a galaxy-full of fellow travelers: Zaphod Beeblebrox--the two-headed, three-armed ex-hippie and totally out-to-lunch president of the galaxy; Trillian, Zaphod's girlfriend (formally Tricia McMillan), whom Arthur tried to pick up at a cocktail party once upon a time zone; Marvin, a paranoid, brilliant, and chronically depressed robot; Veet Voojagig, a former graduate student who is obsessed with the disappearance of all the ballpoint pens he bought over the years.</p><p>Where are these pens? Why are we born? Why do we die? Why do we spend so much time between wearing digital watches? For all the answers stick your thumb to the stars. And don't forget to bring a towel!</p><p><b>The Restaurant at the End of the Universe</b><br />Facing annihilation at the hands of the warlike Vogons is a curious time to have a craving for tea. It could only happen to the cosmically displaced Arthur Dent and his curious comrades in arms as they hurtle across space powered by pure improbability--and desperately in search of a place to eat.</p><p>Among Arthur's motley shipmates are Ford Prefect, a longtime friend and expert contributor to <i>The Hitchhiker's Guide to the Galaxy</i>; Zaphod Beeblebrox, the three-armed, two-headed ex-president of the galaxy; Tricia McMillan, a fellow Earth refugee who's gone native (her name is Trillian now); and Marvin, the moody android who suffers nothing and no one very gladly. Their destination? The ultimate hot spot for an evening of apocalyptic entertainment and fine dining, where the food (literally) speaks for itself.</p><p>Will they make it? The answer: hard to say. But bear in mind that the Hitchhiker's Guide deleted the term \"Future Perfect\" from its pages, since it was discovered not to be!</p><p>\"What's such fun is how amusing the galaxy looks through Adams' sardonically silly eyes.\"</p><p><b>Life, the Universe and Everything</b><br />The unhappy inhabitants of planet Krikkit are sick of looking at the night sky above their heads--so they plan to destroy it. The universe, that is. Now only five individuals stand between the white killer robots of Krikkit and their goal of total annihilation.</p><p>They are Arthur Dent, a mild-mannered space and time traveler, who tries to learn how to fly by throwing himself at the ground and missing; Ford Prefect, his best friend, who decides to go insane to see if he likes it; Slartibartfast, the indomitable vicepresident of the Campaign for Real Time, who travels in a ship powered by irrational behavior; Zaphod Beeblebrox, the two-headed, three-armed ex-head honcho of the Universe; and Trillian, the sexy space cadet who is torn between a persistent Thunder God and a very depressed Beeblebrox.</p><p>How will it all end? Will it end? Only this stalwart crew knows as they try to avert \"universal\" Armageddon and save life as we know it--and don't know it!</p><p><b>So Long, and Thanks for All the Fish</b><br />Back on Earth with nothing more to show for his long, strange trip through time and space than a ratty towel and a plastic shopping bag, Arthur Dent is ready to believe that the past eight years were all just a figment of his stressed-out imagination. But a gift-wrapped fishbowl with a cryptic inscription, the mysterious disappearance of Earth's dolphins, and the discovery of his battered copy of <i>The Hitchhiker's Guide to the Galaxy</i> all conspire to give Arthur the sneaking suspicion that something otherworldly is indeed going on. . . .</p><p>God only knows what it all means. And fortunately, He left behind a Final Message of explanation. But since it's light-years away from Earth, on a star surrounded by souvenir booths, finding out what it is will mean hitching a ride to the far reaches of space aboard a UFO with a giant robot. But what else is new?</p><p><b>Mostly Harmless</b><br />It’s easy to get disheartened when your planet has been blown up, the woman you love has vanished due to a misunderstanding about space/time, the spaceship you are on crashes on a remote and Bob-fearing planet, and all you have to fall back on are a few simple sandwich-making skills. However, instead of being disheartened, Arthur Dent makes the terrible mistake of starting to enjoy life a bit–and immediately all hell breaks loose.</p><p>Hell takes a number of forms: there’s the standard Ford Prefect version, in the shape of an all-new edition of <i>The Hitchhiker’s Guide to the Galaxy</i>, and a totally unexpected manifestation in the form of a teenage girl who startles Arthur Dent by being his daughter when he didn’t even know he had one.</p><p>Can Arthur save the Earth from total multidimensional obliteration? Can he save the Guide from a hostile alien takeover? Can he save his daughter, Random, from herself? Of course not. He never works out exactly what is going on. Will you?</p><p><b>Young Zaphod</b><br />The story is a prequel to the events in <i>The Hitchhiker's Guide to the Galaxy</i> and has the young Zaphod Beeblebrox working as a salvage ship operator. He guides some bureaucrats to a crashed spaceship that may be leaking some dangerous materials, radioactive, toxic and otherwise hazardous by-products which were destined to be thrown into a black hole. The bureaucrats swear that it is \"perfectly safe.\" When asked why they want to see it if that is true, they claim that they \"like looking at things that are perfectly safe.\"</p><p>Since this was before Zaphod blocked off sections of his own brain for the presidency, readers are able to glimpse what his original personality was like. His general speech patterns and goof-off personality are the same, but he seems to have moral views and is more likely to go off on life-threatening and exciting quests for the greater good.</p><p>Throughout the story, it is emphasised that there is something particularly dangerous on board that ought to have been utterly destroyed, but is feared to have escaped.</p><p>Ultimately, it is revealed that the something was actually three identical \"Designer People\". The personalities seem totally benign, which is what makes them so dangerous. The ship is filled with substances so dangerous that they are safe because no one who would actually use them would be let near. The personalities, products of a Sirius Cybernetics Corporation project, however, have custom personalities that could not naturally exist. There is \"nothing they will not do if allowed, and there is nothing they will not be allowed to do.\" Since no one will recognise that they are capable of mass destruction (despite their good intentions), no one will stop them from doing the unspeakable.</p>", 
      "id": 12, 
      "large_img": "https://images.gr-assets.com/books/1404658218m/12.jpg", 
      "list": null, 
      "published_date": "11", 
      "rating": 4.38, 
      "series_id": null, 
      "small_img": "https://images.gr-assets.com/books/1404658218s/12.jpg", 
      "title": "The Ultimate Hitchhiker's Guide: Five Complete Novels and One Story (Hitchhiker's Guide to the Galaxy, #1-5)"
    }, 
    {
      "description": "In Bryson's biggest book, he confronts his greatest challenge: to understand—and, if possible, answer—the oldest, biggest questions we have posed about the universe and ourselves. Taking as territory everything from the Big Bang to the rise of civilization, Bryson seeks to understand how we got from there being nothing at all to there being us. To that end, he has attached himself to a host of the world’s most advanced (and often obsessed) archaeologists, anthropologists, and mathematicians, travelling to their offices, laboratories, and field camps. He has read (or tried to read) their books, pestered them with questions, apprenticed himself to their powerful minds. <b>A Short History of Nearly Everything</b><i> </i>is the record of this quest, and it is a sometimes profound, sometimes funny, and always supremely clear and entertaining adventure in the realms of human knowledge, as only Bill Bryson can render it. Science has never been more involving or entertaining.", 
      "id": 21, 
      "large_img": "https://s.gr-assets.com/assets/nophoto/book/111x148-bcc042a9c91a29c1d680899eff700a03.png", 
      "list": null, 
      "published_date": "unknown_year", 
      "rating": 4.19, 
      "series_id": null, 
      "small_img": "https://s.gr-assets.com/assets/nophoto/book/50x75-a91bf249278a81aabab721ef782c4a74.png", 
      "title": "A Short History of Nearly Everything"
    }, 
    {
      "description": "This four volume, deluxe paperback boxed set contains J.R.R. Tolkien's epic masterworks <i>The Hobbit</i> and the three volumes of <i>The Lord Of The Rings</i> (<i>The Fellowship Of The Ring, The Two Towers,</i> and <i>The Return Of The King</i>) in their definitive text settings complete with maps and cover illustrations from the motion pictures. In <i>The Hobbit,</i> Bilbo Baggins is whisked away from his comfortable, unambitious life in Hobbiton by the wizard Gandalf and a company of dwarves. He finds himself caught up in a plot to raid the treasure hoard of Smaug the Magnificent, <i>The Lord Of The Rings</i> tells of the great and dangerous quest undertaken by Frodo Baggins and the Fellowship of the Ring: Gandalf the wizard; the hobbits Merry, Pippin, and Sam; Gimli the dwarf; Legolas the elf; Boromir of Gondor; and a tall, mysterious stranger called Strider. J.R.R. Tolkien's three volume masterpiece is at once a classic myth and a modern fairy tale - a story of high and heroic adventure set in the unforgettable landscape of Middle-Earth.<p></p>", 
      "id": 30, 
      "large_img": "https://images.gr-assets.com/books/1346072396m/30.jpg", 
      "list": null, 
      "published_date": "9", 
      "rating": 4.59, 
      "series_id": null, 
      "small_img": "https://images.gr-assets.com/books/1346072396s/30.jpg", 
      "title": "J.R.R. Tolkien 4-Book Boxed Set: The Hobbit and The Lord of the Rings"
    }, 
    {
      "description": "Gerald Samper, an effete English snob, has his own private hilltop in Tuscany, where he whiles away his time working as a ghostwriter for celebrities and inventing wholly original culinary concoctions — including ice cream made with garlic and the bitter, herb-based liqueur of the book's title. Gerald's idyll is shattered by the arrival of Marta, on the run from a crime-riddled former soviet republic. A series of hilarious misunderstandings brings this odd couple into ever closer and more disastrous proximity.<br /><br />James Hamilton-Paterson's first novel, \"Gerontius,\" won the Whitbread Award. He is an acclaimed author of nonfiction books, including \"Seven-Tenths,\" \"Three Miles Down,\" and \"Playing with Water,\" He currently lives in Italy.", 
      "id": 40, 
      "large_img": "https://s.gr-assets.com/assets/nophoto/book/111x148-bcc042a9c91a29c1d680899eff700a03.png", 
      "list": null, 
      "published_date": "unknown_day-2005", 
      "rating": 3.62, 
      "series_id": null, 
      "small_img": "https://s.gr-assets.com/assets/nophoto/book/50x75-a91bf249278a81aabab721ef782c4a74.png", 
      "title": "Cooking with Fernet Branca (Gerald Samper, #1)"
    }, 
    {
      "description": "Rails is a full-stack, open source web framework that enables you to create full-featured, sophisticated web-based applications, but with a twist... A full Rails application probably has less total code than the XML you'd need to configure the same application in other frameworks. With this book you'll learn how to use \"ActiveRecord\" to connect business objects and database tables. No more painful object-relational mapping. Just create your business objects and let Rails do the rest. You'll learn how to use the \"Action Pack\" framework to route incoming requests and render pages using easy-to-write templates and components. See how to exploit the Rails service frameworks to send emails, implement web services, and create dynamic, user-centric web-pages using built-in Javascript and Ajax support. There are extensive chapters on testing, deployment, and scaling. You'll see how easy it is to install Rails using your web server of choice (such as Apache or lighttpd) or using its own included web server. You'll be writing applications that work with your favorite database (MySQL, Oracle, Postgres, and more) in no time at all. You'll create a complete online store application in the extended tutorial section, so you'll see how a full Rails application is developed---iteratively and rapidly. Rails strives to honor the Pragmatic Programmer's \"DRY Principle\" by avoiding the extra work of configuration files and code annotations. You can develop in real-time: make a change, and watch it work immediately. Forget XML. Everything in Rails, from templates to control flow to business logic, is written in Ruby, the language of choice for programmers who like to get the job done well (and leave work ontime for a change). Rails is the framework of choice for the new generation of Web 2.0 developers. Agile Web Development with Rails is the book for that generation, written by Dave Thomas (Pragmatic Programmer and author of Programming Ruby) and David Heinemeier Hansson, who created Rails.", 
      "id": 45, 
      "large_img": "https://s.gr-assets.com/assets/nophoto/book/111x148-bcc042a9c91a29c1d680899eff700a03.png", 
      "list": null, 
      "published_date": "7", 
      "rating": 3.9, 
      "series_id": null, 
      "small_img": "https://s.gr-assets.com/assets/nophoto/book/50x75-a91bf249278a81aabab721ef782c4a74.png", 
      "title": "Agile Web Development with Rails: A Pragmatic Guide"
    }, 
    {
      "description": "Wharton's final novel (completed by Marion Mainwaring after the author's death in 1937) revolves around American and British society in the 1870s. Told in large part through the eyes of American debutantes, the story portrays innocent, wide-eyed, almost ethereal girls who turn into socially conscious women with financial worries--unrecognizable even to themselves. The beginning sections quickly catch the listener's attention, with lush descriptions of rooms, clothes, and the heights of feminine beauty. We enter a world of intrigue: secrets, characters with past relationships that could prove fatal, and competition taken to its limits. Its literary value notwithstanding, this book might appeal to soap opera and romance fans. For more attentive listeners, it quickly becomes disconcerting as more and more characters with awkward British-sounding names are added. It's increasingly difficult to recall who's who without backing up the tape. Most libraries can pass on this one.-- Rochelle Ratner, formerly Poetry Editor, \"Soho Weekly News\", New York", 
      "id": 48, 
      "large_img": "https://s.gr-assets.com/assets/nophoto/book/111x148-bcc042a9c91a29c1d680899eff700a03.png", 
      "list": null, 
      "published_date": "7", 
      "rating": 3.89, 
      "series_id": null, 
      "small_img": "https://s.gr-assets.com/assets/nophoto/book/50x75-a91bf249278a81aabab721ef782c4a74.png", 
      "title": "The Bucaneers"
    }, 
    {
      "description": "Brian is on his way to Canada to visit his estranged father when the pilot of his small prop plane suffers a heart attack. Brian is forced to crash-land the plane in a lake--and finds himself stranded in the remote Canadian wilderness with only his clothing and the hatchet his mother gave him as a present before his departure. <br /><br />Brian had been distraught over his parents' impending divorce and the secret he carries about his mother, but now he is truly desolate and alone. Exhausted, terrified, and hungry, Brian struggles to find food and make a shelter for himself. He has no special knowledge of the woods, and he must find a new kind of awareness and patience as he meets each day's challenges. Is the water safe to drink? Are the berries he finds poisonous? <br /><br />Slowly, Brian learns to turn adversity to his advantage--an invading porcupine unexpectedly shows him how to make fire, a devastating tornado shows him how to retrieve supplies from the submerged airplane. Most of all, Brian leaves behind the self-pity he has felt about his predicament as he summons the courage to stay alive. <br /><br />A story of survival and of transformation, this riveting book has sparked many a reader's interest in venturing into the wild.", 
      "id": 50, 
      "large_img": "https://s.gr-assets.com/assets/nophoto/book/111x148-bcc042a9c91a29c1d680899eff700a03.png", 
      "list": null, 
      "published_date": "unknown_year", 
      "rating": 3.68, 
      "series_id": null, 
      "small_img": "https://s.gr-assets.com/assets/nophoto/book/50x75-a91bf249278a81aabab721ef782c4a74.png", 
      "title": "Hatchet (Brian's Saga, #1)"
    }, 
    {
      "description": "Ivy Carson belonged to the notorious Carson family, which lived in a run-down house in suburban Rosewood. But Ivy was not a typical Carson. There was something wonderful about her. Ivy explained it by saying that she was a changeling, a child of supernatural parents who had been exchanged for the real Ivy Carson at birth. This classic book was first published in 1970. It was awarded a Christopher Medal and named an outstanding book for young people by the Junior Library Guild.", 
      "id": 61, 
      "large_img": "https://s.gr-assets.com/assets/nophoto/book/111x148-bcc042a9c91a29c1d680899eff700a03.png", 
      "list": null, 
      "published_date": "6", 
      "rating": 4.16, 
      "series_id": null, 
      "small_img": "https://s.gr-assets.com/assets/nophoto/book/50x75-a91bf249278a81aabab721ef782c4a74.png", 
      "title": "The Changeling"
    }, 
    {
      "description": "One of the most acclaimed novels in recent memory, <i>The Known World</i> is a daring and ambitious work by Pulitzer Prize winner Edward P. Jones.<br /><br /><i>The Known World</i> tells the story of Henry Townsend, a black farmer and former slave who falls under the tutelage of William Robbins, the most powerful man in Manchester County, Virginia. Making certain he never circumvents the law, Townsend runs his affairs with unusual discipline. But when death takes him unexpectedly, his widow, Caldonia, can't uphold the estate's order, and chaos ensues. Jones has woven a footnote of history into an epic that takes an unflinching look at slavery in all its moral complexities.", 
      "id": 67, 
      "large_img": "https://s.gr-assets.com/assets/nophoto/book/111x148-bcc042a9c91a29c1d680899eff700a03.png", 
      "list": null, 
      "published_date": "8", 
      "rating": 3.82, 
      "series_id": null, 
      "small_img": "https://s.gr-assets.com/assets/nophoto/book/50x75-a91bf249278a81aabab721ef782c4a74.png", 
      "title": "The Known World"
    }, 
    {
      "description": "Orphaned Heidi lives with her gruff but caring grandfather on the side of Swiss mountain, where she befriends young Peter the goat-herd. She leads an idyllic life, until she is forced to leave the mountain she has always known to go and live with a sickly girl in the city. Will Heidi ever see her grandfather again? A classic tale of a young girl's coming-of-age, of friendship, and familial love.", 
      "id": 93, 
      "large_img": "https://s.gr-assets.com/assets/nophoto/book/111x148-bcc042a9c91a29c1d680899eff700a03.png", 
      "list": null, 
      "published_date": "11", 
      "rating": 3.97, 
      "series_id": null, 
      "small_img": "https://s.gr-assets.com/assets/nophoto/book/50x75-a91bf249278a81aabab721ef782c4a74.png", 
      "title": "Heidi"
    }, 
    {
      "description": "Centuries have passed on Dune, and the planet is green with life. Leto, the son of Dune's savior, is still alive but far from human, and the fate of all humanity hangs on his awesome sacrifice...\"Rich fare...heady stuff.\"--<b>Los Angeles Times</b>", 
      "id": 103, 
      "large_img": "https://s.gr-assets.com/assets/nophoto/book/111x148-bcc042a9c91a29c1d680899eff700a03.png", 
      "list": null, 
      "published_date": "6", 
      "rating": 3.81, 
      "series_id": null, 
      "small_img": "https://s.gr-assets.com/assets/nophoto/book/50x75-a91bf249278a81aabab721ef782c4a74.png", 
      "title": "God Emperor of Dune (Dune Chronicles, #4)"
    }, 
    {
      "description": "The desert planet Arrakis, called Dune, has been destroyed. Now, the Bene Gesserit, heirs to Dune's power, have colonized a green world--and are turning it into a desert, mile by scorched mile.<br />Here is the last book <b>Frank Herbert</b> wrote before his death. A stunning climax to the epic Dune legend that will live on forever...", 
      "id": 105, 
      "large_img": "https://images.gr-assets.com/books/1260954505m/105.jpg", 
      "list": null, 
      "published_date": "7", 
      "rating": 3.89, 
      "series_id": null, 
      "small_img": "https://images.gr-assets.com/books/1260954505s/105.jpg", 
      "title": "Chapterhouse: Dune (Dune Chronicles #6)"
    }, 
    {
      "description": "<b>Dune Messiah</b> continues the story of the man Muad'dib, heir to a power unimaginable, bringing to completion the centuries-old scheme to create a super-being.\"Brilliant...It is all that <b>Dune</b> was, and maybe a little bit more.\"--<b>Galaxy Magazine</b>", 
      "id": 106, 
      "large_img": "https://images.gr-assets.com/books/1392528394m/106.jpg", 
      "list": null, 
      "published_date": "7", 
      "rating": 3.86, 
      "series_id": null, 
      "small_img": "https://images.gr-assets.com/books/1392528394s/106.jpg", 
      "title": "Dune Messiah (Dune Chronicles #2)"
    }, 
    {
      "description": "The desert planet of Arrakis has begun to grow green and lush. The life-giving spice is abundant. The nine-year-old royal twins, possesing their father's supernatural powers, are being groomed as Messiahs.<br />But there are those who think the Imperium does not need messiahs...", 
      "id": 112, 
      "large_img": "https://s.gr-assets.com/assets/nophoto/book/111x148-bcc042a9c91a29c1d680899eff700a03.png", 
      "list": null, 
      "published_date": "5", 
      "rating": 3.9, 
      "series_id": null, 
      "small_img": "https://s.gr-assets.com/assets/nophoto/book/50x75-a91bf249278a81aabab721ef782c4a74.png", 
      "title": "Children of Dune (Dune Chronicles #3)"
    }, 
    {
      "description": "With more than ten million copies sold, <b>Frank Herbert</b>'s magnificent <b>Dune</b> books stand among the major achievements of the human imagination. In this, the fifth and most spectacular <b>Dune</b> book of all, the planet Arrakis--now called Rakis--is becoming desert again. The Lost Ones are returning home from the far reaches of space. The great sandworms are dying. And the children of Dune's children awaken from empire as from a dream, wielding the new power of a heresy called love...", 
      "id": 117, 
      "large_img": "https://s.gr-assets.com/assets/nophoto/book/111x148-bcc042a9c91a29c1d680899eff700a03.png", 
      "list": null, 
      "published_date": "8", 
      "rating": 3.84, 
      "series_id": null, 
      "small_img": "https://s.gr-assets.com/assets/nophoto/book/50x75-a91bf249278a81aabab721ef782c4a74.png", 
      "title": "Heretics of Dune (Dune Chronicles #5)"
    }, 
    {
      "description": "Ruby is an increasingly popular, fully object-oriented dynamic programming language, hailed by many practitioners as the finest and most useful language available today. When Ruby first burst onto the scene in the Western world, the Pragmatic Programmers were there with the definitive reference manual, <i>Programming Ruby: The Pragmatic Programmer's Guide</i>.<br /><br />Now in its second edition, author Dave Thomas has expanded the famous Pickaxe book with over 200 pages of new content, covering all the improved language features of Ruby 1.8 and standard library modules. The Pickaxe contains four major sections:<br /><br /><br />An acclaimed tutorial on using Ruby.<br />The definitive reference to the language.<br />Complete documentation on all built-in classes, modules, and methods<br />Complete descriptions of all 98 standard libraries.<br /><br /><br />If you enjoyed the First Edition, you'll appreciate the expanded content, including enhanced coverage of installation, packaging, documenting Ruby source code, threading and synchronization, and enhancing Ruby's capabilities using C-language extensions. Programming for the World Wide Web is easy in Ruby, with new chapters on XML/RPC, SOAP, distributed Ruby, templating systems, and other web services. There's even a new chapter on unit testing.<br /><br />This is the definitive reference manual for Ruby, including a description of all the standard library modules, a complete reference to all built-in classes and modules (including more than 250 significant changes since the First Edition). Coverage of other features has grown tremendously, including details on how to harness the sophisticated capabilities of irb, so you can dynamically examine and experiment with your running code. \"Ruby is a wonderfully powerful and useful language, and whenever I'm working with it this book is at my side\" --Martin Fowler, Chief Scientist, ThoughtWorks", 
      "id": 515, 
      "large_img": "https://s.gr-assets.com/assets/nophoto/book/111x148-bcc042a9c91a29c1d680899eff700a03.png", 
      "list": null, 
      "published_date": "10", 
      "rating": 4.06, 
      "series_id": null, 
      "small_img": "https://s.gr-assets.com/assets/nophoto/book/50x75-a91bf249278a81aabab721ef782c4a74.png", 
      "title": "Programming Ruby: The Pragmatic Programmers' Guide"
    }, 
    {
      "description": "The first time Melanie Ross meets April Hall, she's not sure they'll have anything in common. But she soon discovers that they both love anything to do with ancient Egypt. When they stumble upon a deserted storage yard behind the A-Z Antiques and Curio Shop, Melanie and April decide it's the perfect sport for the Egypt Game.<br /><br />Before long there are six Egyptians instead of two. After school and on weekends they all meet to wear costumes, hold ceremonies, and work on their secret code.<br /><br />Everyone thinks it's just a game, until strange things begin happening to the players. Has the Egypt Game gone too far?", 
      "id": 903, 
      "large_img": "https://s.gr-assets.com/assets/nophoto/book/111x148-bcc042a9c91a29c1d680899eff700a03.png", 
      "list": null, 
      "published_date": "7", 
      "rating": 3.81, 
      "series_id": null, 
      "small_img": "https://s.gr-assets.com/assets/nophoto/book/50x75-a91bf249278a81aabab721ef782c4a74.png", 
      "title": "The Egypt Game (Game, #1)"
    }, 
    {
      "description": "<i>In a hole in the ground there lived a hobbit. Not a nasty, dirty, wet hole, filled with the ends of worms and an oozy smell, nor yet a dry, bare, sandy hole with nothing in it to sit down on or to eat: it was a hobbit-hole, and that means comfort.<br /><br /></i>Written for J.R.R. Tolkien’s own children, <i>The Hobbit</i> met with instant critical acclaim when it was first published in 1937. Now recognized as a timeless classic, this introduction to the hobbit Bilbo Baggins, the wizard Gandalf, Gollum, and the spectacular world of Middle-earth recounts of the adventures of a reluctant hero, a powerful and dangerous ring, and the cruel dragon Smaug the Magnificent. The text in this 372-page paperback edition is based on that first published in Great Britain by Collins Modern Classics (1998), and includes a note on the text by Douglas A. Anderson (2001). Unforgettable!<br />", 
      "id": 5907, 
      "large_img": "https://images.gr-assets.com/books/1372847500m/5907.jpg", 
      "list": null, 
      "published_date": "8", 
      "rating": 4.25, 
      "series_id": null, 
      "small_img": "https://images.gr-assets.com/books/1372847500s/5907.jpg", 
      "title": "The Hobbit"
    }, 
    {
      "description": "In one of the most important and beloved Latin American works of the twentieth century, Isabel Allende weaves a luminous tapestry of three generations of the Trueba family, revealing both triumphs and tragedies. <br /><br />Here is patriarch Esteban, whose wild desires and political machinations are tempered only by his love for his ethereal wife, Clara, a woman touched by an otherworldly hand. Their daughter, Blanca, whose forbidden love for a man Esteban has deemed unworthy infuriates her father, yet will produce his greatest joy: his granddaughter Alba, a beautiful, ambitious girl who will lead the family and their country into a revolutionary future.<br /><br /><i>The House of the Spirits</i> is an enthralling saga that spans decades and lives, twining the personal and the political into an epic novel of love, magic, and fate.", 
      "id": 9328, 
      "large_img": "https://images.gr-assets.com/books/1358615501m/9328.jpg", 
      "list": null, 
      "published_date": "unknown_year", 
      "rating": 4.2, 
      "series_id": null, 
      "small_img": "https://images.gr-assets.com/books/1358615501s/9328.jpg", 
      "title": "The House of the Spirits"
    }, 
    {
      "description": "Subtitle: Rediscovering America on the Appalachian Trail. The Appalachian Trail stretches from Georgia to Maine and covers some of the most breathtaking terrain in America–majestic mountains, silent forests, sparking lakes. If you’re going to take a hike, it’s probably the place to go. And Bill Bryson is surely the most entertaining guide you’ll find. He introduces us to the history and ecology of the trail and to some of the other hardy (or just foolhardy) folks he meets along the way–and a couple of bears. Already a classic, <i>A Walk in the Woods </i> will make you long for the great outdoors (or at least a comfortable chair to sit and read in).", 
      "id": 9791, 
      "large_img": "https://s.gr-assets.com/assets/nophoto/book/111x148-bcc042a9c91a29c1d680899eff700a03.png", 
      "list": null, 
      "published_date": "unknown_year", 
      "rating": 4.05, 
      "series_id": null, 
      "small_img": "https://s.gr-assets.com/assets/nophoto/book/50x75-a91bf249278a81aabab721ef782c4a74.png", 
      "title": "A Walk in the Woods"
    }, 
    {
      "description": null, 
      "id": 17220, 
      "large_img": "https://s.gr-assets.com/assets/nophoto/book/111x148-bcc042a9c91a29c1d680899eff700a03.png", 
      "list": null, 
      "published_date": "unknown_year", 
      "rating": 3.67, 
      "series_id": null, 
      "small_img": "https://s.gr-assets.com/assets/nophoto/book/50x75-a91bf249278a81aabab721ef782c4a74.png", 
      "title": "Starship Troopers: The Roleplaying Game"
    }, 
    {
      "description": "Winner of the 1921 Pulitzer Prize, <i>The Age of Innocence</i> is <b>Edith Wharton</b>’s masterful portrait of desire and betrayal during the sumptuous Golden Age of Old New York, a time when society people “dreaded scandal more than disease.”<br /><br />This is Newland Archer’s world as he prepares to marry the beautiful but conventional May Welland. But when the mysterious Countess Ellen Olenska returns to New York after a disastrous marriage, Archer falls deeply in love with her. Torn between duty and passion, Archer struggles to make a decision that will either courageously define his life—or mercilessly destroy it.", 
      "id": 53835, 
      "large_img": "https://s.gr-assets.com/assets/nophoto/book/111x148-bcc042a9c91a29c1d680899eff700a03.png", 
      "list": null, 
      "published_date": "8", 
      "rating": 3.93, 
      "series_id": null, 
      "small_img": "https://s.gr-assets.com/assets/nophoto/book/50x75-a91bf249278a81aabab721ef782c4a74.png", 
      "title": "The Age of Innocence"
    }, 
    {
      "description": "The Mendoza family was one of Spain's most prominent Renaissance dynasties, and this collection, a groundbreaking overview of two hundred years of Spanish history, provides in-depth portraits of eight of its female members. These essays explore the lives of powerful women whose lineage gave them status within a patriarchal society designed to keep women from public life. Each of the influential and literary women discussed in this volume handled her status differently, and their concerns were not dissimilar from the concerns of feminists today: the blurring of the personal and the political, public versus private space, language and voice, and property. Spanning the two centuries between Juana Pimentel, a widow who manipulated the patronage system to her own ends, and Luisa de Carvajal y Mendoza, who rejected both convent and marriage in favor of missionary work, Power and Gender in Renaissance Spain reveals a complex society in which women were limited by law, and yet their social status made those laws negotiable. These women found that their personal agendas had a broad societal impact, challenging the laws of the land and patriarchal assumptions about women's inferiority.", 
      "id": 187865, 
      "large_img": "https://s.gr-assets.com/assets/nophoto/book/111x148-bcc042a9c91a29c1d680899eff700a03.png", 
      "list": null, 
      "published_date": "11", 
      "rating": 4.25, 
      "series_id": 50296, 
      "small_img": "https://s.gr-assets.com/assets/nophoto/book/50x75-a91bf249278a81aabab721ef782c4a74.png", 
      "title": "Power and Gender in Renaissance Spain: Eight Women of the Mendoza Family, 1450-1650"
    }, 
    {
      "description": "This book was mistakenly published under <a href=\"https://www.goodreads.com/book/show/2184419.Masculino_Que_Ninguno\" rel=\"nofollow\">ISBN13: 9780965017763</a>.<br /><br />Set in the far future amidst a sprawling feudal interstellar empire where planetary dynasties are controlled by noble houses that owe an allegiance to the imperial House Corrino, Dune tells the story of young Paul Atreides (the heir apparent to Duke Leto Atreides and heir of House Atreides) as he and his family accept control of the desert planet Arrakis, the only source of the 'spice' melange, the most important and valuable substance in the cosmos. The story explores the complex, multi-layered interactions of politics, religion, ecology, technology, and human emotion as the forces of the empire confront each other for control of Arrakis.<br /><br />Published in 1965, it won the Hugo Award in 1966 and the inaugural Nebula Award for Best Novel. Dune is frequently cited as the world's best-selling sf novel.", 
      "id": 234225, 
      "large_img": "https://images.gr-assets.com/books/1434908555m/234225.jpg", 
      "list": null, 
      "published_date": "6", 
      "rating": 4.19, 
      "series_id": null, 
      "small_img": "https://images.gr-assets.com/books/1434908555s/234225.jpg", 
      "title": "Dune (Dune Chronicles #1)"
    }, 
    {
      "description": "During the American Civil War a good map could spell the difference between and defeat. This book brings together some of the most interesting and beautiful maps of the period, from detailed renderings to rough pencil sketches drawn on horseback.", 
      "id": 243301, 
      "large_img": "https://images.gr-assets.com/books/1336312531m/243301.jpg", 
      "list": null, 
      "published_date": "10", 
      "rating": 3.92, 
      "series_id": 58307, 
      "small_img": "https://images.gr-assets.com/books/1336312531s/243301.jpg", 
      "title": "Maps and Mapmakers of the Civil War"
    }, 
    {
      "description": "In this magical bestseller, the story-telling heroine of Eva Luna returns with a rich treasure trove of tales--two dozen vibrant, enchanting demonstrations of her artistry. Here is the foreign made indelibly familiar by the imagination, the passion, and the eloquence of one of the world's leading writers.", 
      "id": 268218, 
      "large_img": "https://s.gr-assets.com/assets/nophoto/book/111x148-bcc042a9c91a29c1d680899eff700a03.png", 
      "list": null, 
      "published_date": "2", 
      "rating": 3.96, 
      "series_id": 62223, 
      "small_img": "https://s.gr-assets.com/assets/nophoto/book/50x75-a91bf249278a81aabab721ef782c4a74.png", 
      "title": "Stories of Eva Luna"
    }, 
    {
      "description": "The Babylon 5 sourcebook containing all the information for using Season 3, advancing the storyline to this time.", 
      "id": 279420, 
      "large_img": "https://s.gr-assets.com/assets/nophoto/book/111x148-bcc042a9c91a29c1d680899eff700a03.png", 
      "list": null, 
      "published_date": "unknown_year", 
      "rating": 4.33, 
      "series_id": 64314, 
      "small_img": "https://s.gr-assets.com/assets/nophoto/book/50x75-a91bf249278a81aabab721ef782c4a74.png", 
      "title": "Babylon 5: The Point Of No Return (Babylon 5 (Mongoose Publishing))"
    }, 
    {
      "description": "Seconds before Earth is demolished to make way for a galactic freeway, Arthur Dent is plucked off the planet by his friend Ford Prefect, a researcher for the revised edition of <i>The Hitchhiker’s Guide to the Galaxy </i>who, for the last fifteen years, has been posing as an out-of-work actor.<br /><br />Together, this dynamic pair began a journey through space aided by a galaxyful of fellow travelers: Zaphod Beeblebrox, the two-headed, three-armed, ex-hippie and totally out-to-lunch president of the galaxy; Trillian (formerly Tricia McMillan), Zaphod’s girlfriend, whom Arthur tried to pick up at a cocktail party once upon a time zone; Marvin, a paranoid, brilliant, and chronically depressed robot; and Veet Voojagig, a former graduate student obsessed with the disappearance of all the ballpoint pens he’s bought over the years.<br /><br />Where are these pens? Why are we born? Why do we die? For all the answers, stick your thumb to the stars!", 
      "id": 386162, 
      "large_img": "https://s.gr-assets.com/assets/nophoto/book/111x148-bcc042a9c91a29c1d680899eff700a03.png", 
      "list": null, 
      "published_date": "6", 
      "rating": 4.2, 
      "series_id": null, 
      "small_img": "https://s.gr-assets.com/assets/nophoto/book/50x75-a91bf249278a81aabab721ef782c4a74.png", 
      "title": "The Hitchhiker's Guide to the Galaxy (Hitchhiker's Guide, #1)"
    }, 
    {
      "description": null, 
      "id": 853306, 
      "large_img": "https://s.gr-assets.com/assets/nophoto/book/111x148-bcc042a9c91a29c1d680899eff700a03.png", 
      "list": null, 
      "published_date": "7", 
      "rating": 0.0, 
      "series_id": 40957, 
      "small_img": "https://s.gr-assets.com/assets/nophoto/book/50x75-a91bf249278a81aabab721ef782c4a74.png", 
      "title": "Modern Day Heroes: In Defense Of America: In Defense Of America"
    }, 
    {
      "description": "<i>Darwinian Politics</i> is the first book to examine political behavior from a modern evolutionary perspective. Here, Paul H. Rubin discusses group or social behavior, including ethnic and racial conflict; altruism and cooperation; envy; political power; and the role of religion in politics ¾ issues that have formed the hallmark of human social behavior.<br /><br />Adopting a Darwinian perspective, Rubin demonstrates why certain political-moral philosophies succeed or fail in modern Western culture. He begins by showing relationships between biology and natural selection and the history of political philosophy and explains why desirable policies must treat each person as an individual. He considers the notion of group identity and conflict, observing a human propensity to form in-groups, a behavior that does not necessitate but often leads to deviancies such as racism. In discussing altruism, Rubin shows that people are willing to aid the poor if they are convinced that the recipients are not shirkers or free loaders. This explains why recent welfare reforms are widely viewed as successful. Envy, a trait that is often counterproductive in today’s world, is also addressed. In comparing major moral philosophical systems, Rubin contends that utilitarianism is broadly consistent with our evolved preferences. He illustrates evolutionary premises for religious belief and for desires to regulate the behavior of others, and how in today’s world such regulation may not serve any useful purpose.<br /><br />Ultimately, Rubin argues that humans naturally seek political freedom, and modern Western society provides more freedom than any previous one. In light of his analysis, the author extrapolates that, while there are still areas for improvements, humans have done a remarkably good job of satisfying their evolved political preferences.", 
      "id": 853696, 
      "large_img": "https://s.gr-assets.com/assets/nophoto/book/111x148-bcc042a9c91a29c1d680899eff700a03.png", 
      "list": null, 
      "published_date": "8", 
      "rating": 3.62, 
      "series_id": null, 
      "small_img": "https://s.gr-assets.com/assets/nophoto/book/50x75-a91bf249278a81aabab721ef782c4a74.png", 
      "title": "Darwinian Politics: The Evolutionary Origin of Freedom"
    }, 
    {
      "description": null, 
      "id": 874655, 
      "large_img": "https://s.gr-assets.com/assets/nophoto/book/111x148-bcc042a9c91a29c1d680899eff700a03.png", 
      "list": null, 
      "published_date": "unknown_year", 
      "rating": 0.0, 
      "series_id": 45175, 
      "small_img": "https://s.gr-assets.com/assets/nophoto/book/50x75-a91bf249278a81aabab721ef782c4a74.png", 
      "title": "Business Firms And The Common Law: The Evolution Of Efficient Rules"
    }, 
    {
      "description": "<b>\n  <blockquote>This Hugo &amp; Nebula Award winner tells a sweeping tale of the desert planet Arrakis, the focus of an intricate power struggle in a byzantine interstellar empire.</blockquote>\n</b>Arrakis is the sole source of Melange, “spice of spices”. Melange is necessary for interstellar travel &amp; grants psi powers &amp; longevity. Whoever controls it wields great influence. Troubles begin when stewardship of Arrakis is transferred by the Emperor from the Harkonnen Noble House to House Atreides. The Harkonnens don’t want to give up their privilege. Thru sabotage &amp; treachery they cast young Duke Paul Atreides out into the planet’s harsh environment to die. There he joins the Fremen, a desert dwelling tribe, the basis of the army with which he reclaims what’s rightfully his. Paul is more than just a usurped duke. He might be the end product of a long-term genetic experiment to breed a superhuman. He might be a messiah. His struggle is at the center of a nexus of powerful people &amp; events. Repercussions will be felt throughout the Imperium.<p><i>Dune</i> is one of the most famous sf novels ever written. Deservedly so. The setting is elaborate &amp; ornate, the plot labyrinthine, the adventures exciting. Five sequels follow. —Brooks Peck (edited).</p>", 
      "id": 1022863, 
      "large_img": "https://images.gr-assets.com/books/1464616838m/1022863.jpg", 
      "list": null, 
      "published_date": "6", 
      "rating": 4.19, 
      "series_id": null, 
      "small_img": "https://images.gr-assets.com/books/1464616838s/1022863.jpg", 
      "title": "Dune"
    }, 
    {
      "description": "Memoir by a Patrol Officer who lived and worked in the Northern Territory of Australia, and who made several remarkable expeditions on foot into Arnhem Land, a territory very difficult of access due to the escarpment country which characterizes much of it.", 
      "id": 1044371, 
      "large_img": "https://s.gr-assets.com/assets/nophoto/book/111x148-bcc042a9c91a29c1d680899eff700a03.png", 
      "list": null, 
      "published_date": "unknown_day-1993", 
      "rating": 4.4, 
      "series_id": 49698, 
      "small_img": "https://s.gr-assets.com/assets/nophoto/book/50x75-a91bf249278a81aabab721ef782c4a74.png", 
      "title": "Whispering Wind: Adventures in Arnhem Land"
    }, 
    {
      "description": null, 
      "id": 19029661, 
      "large_img": "https://s.gr-assets.com/assets/nophoto/book/111x148-bcc042a9c91a29c1d680899eff700a03.png", 
      "list": null, 
      "published_date": "unknown_year", 
      "rating": 3.67, 
      "series_id": null, 
      "small_img": "https://s.gr-assets.com/assets/nophoto/book/50x75-a91bf249278a81aabab721ef782c4a74.png", 
      "title": "Lead or Fail: The Essential Principles For Peak Performance Through Leading And Influencing Others"
    }
  ], 
  "review": [
    {
      "book_id": 12, 
      "date_added": "Sat Aug 19 19:10:46 -0700 2006", 
      "id": 2, 
      "rating": 5.0, 
      "review": null, 
      "spoiler_flag": "false", 
      "user": "Otis Chandler"
    }, 
    {
      "book_id": 21, 
      "date_added": "Sat Aug 19 20:01:34 -0700 2006", 
      "id": 3, 
      "rating": 5.0, 
      "review": "A fascinating history of science. Ever curious how everything we know about the world came to be - read this! I loved reading about what old greats like Darwin thought about the world - they were all right about most things, but also very wrong about some things - makes you wonder how much we are...", 
      "spoiler_flag": "false", 
      "user": "Otis Chandler"
    }, 
    {
      "book_id": 30, 
      "date_added": "Sat Aug 19 20:04:10 -0700 2006", 
      "id": 4, 
      "rating": 5.0, 
      "review": null, 
      "spoiler_flag": "false", 
      "user": "Otis Chandler"
    }, 
    {
      "book_id": 40, 
      "date_added": "Sun Aug 20 00:45:00 -0700 2006", 
      "id": 5, 
      "rating": 5.0, 
      "review": "Funny and eloquent and completely pointless.", 
      "spoiler_flag": "false", 
      "user": "Adrian"
    }, 
    {
      "book_id": 45, 
      "date_added": "Tue Aug 29 01:03:09 -0700 2006", 
      "id": 6, 
      "rating": 5.0, 
      "review": null, 
      "spoiler_flag": "false", 
      "user": "Otis Chandler"
    }, 
    {
      "book_id": 48, 
      "date_added": "Tue Aug 29 10:13:29 -0700 2006", 
      "id": 7, 
      "rating": 5.0, 
      "review": "Great read if you like books like Pride and Prejudice; it's one of my all time favorites! Lots of subterfuge and chicanery.", 
      "spoiler_flag": "false", 
      "user": "Elizabeth"
    }, 
    {
      "book_id": 50, 
      "date_added": "Tue Aug 29 10:17:08 -0700 2006", 
      "id": 8, 
      "rating": 5.0, 
      "review": "I've just been thinking about this book lately as I've been admiring the natural world. This author has some amazing insights and I'm thinking of rereading it!", 
      "spoiler_flag": "false", 
      "user": "Elizabeth"
    }, 
    {
      "book_id": 61, 
      "date_added": "Tue Aug 29 10:22:10 -0700 2006", 
      "id": 9, 
      "rating": 5.0, 
      "review": "I don't remember this book well, apart from knowing that I simply loved it when I was in elementary school. I think I must have read this book 20 or 30 times.", 
      "spoiler_flag": "false", 
      "user": "Elizabeth"
    }, 
    {
      "book_id": 67, 
      "date_added": "Tue Aug 29 10:23:25 -0700 2006", 
      "id": 10, 
      "rating": 5.0, 
      "review": "black slave-owners, who knew?", 
      "spoiler_flag": "false", 
      "user": "kelly"
    }, 
    {
      "book_id": 1, 
      "date_added": "Tue Aug 29 11:00:39 -0700 2006", 
      "id": 11, 
      "rating": 5.0, 
      "review": null, 
      "spoiler_flag": "false", 
      "user": "evan pon"
    }, 
    {
      "book_id": 3, 
      "date_added": "Tue Aug 29 11:00:42 -0700 2006", 
      "id": 13, 
      "rating": 5.0, 
      "review": null, 
      "spoiler_flag": "false", 
      "user": "evan pon"
    }, 
    {
      "book_id": 1, 
      "date_added": "Tue Aug 29 11:19:41 -0700 2006", 
      "id": 17, 
      "rating": 5.0, 
      "review": null, 
      "spoiler_flag": "false", 
      "user": "Otis Chandler"
    }, 
    {
      "book_id": 3, 
      "date_added": "Tue Aug 29 11:19:44 -0700 2006", 
      "id": 18, 
      "rating": 5.0, 
      "review": null, 
      "spoiler_flag": "false", 
      "user": "Otis Chandler"
    }, 
    {
      "book_id": 4, 
      "date_added": "Tue Aug 29 11:19:45 -0700 2006", 
      "id": 19, 
      "rating": 5.0, 
      "review": null, 
      "spoiler_flag": "false", 
      "user": "Otis Chandler"
    }, 
    {
      "book_id": 5, 
      "date_added": "Tue Aug 29 11:19:47 -0700 2006", 
      "id": 20, 
      "rating": 5.0, 
      "review": null, 
      "spoiler_flag": "false", 
      "user": "Otis Chandler"
    }, 
    {
      "book_id": 50, 
      "date_added": "Tue Aug 29 11:20:01 -0700 2006", 
      "id": 21, 
      "rating": 5.0, 
      "review": null, 
      "spoiler_flag": "false", 
      "user": "Otis Chandler"
    }, 
    {
      "book_id": 2, 
      "date_added": "Tue Aug 29 11:20:05 -0700 2006", 
      "id": 22, 
      "rating": 5.0, 
      "review": "After the first read, this book is the worst one in the Harry Potter series. Characters are not as likeable as they are in the other books. However, I recently reread it (after reading book 6), and found it to be a very good read.", 
      "spoiler_flag": "false", 
      "user": "Otis Chandler"
    }, 
    {
      "book_id": 6, 
      "date_added": "Tue Aug 29 11:20:10 -0700 2006", 
      "id": 23, 
      "rating": 5.0, 
      "review": "This is the best harry potter book so far, followed closely by book 6.", 
      "spoiler_flag": "false", 
      "user": "Otis Chandler"
    }, 
    {
      "book_id": 93, 
      "date_added": "Tue Aug 29 11:43:10 -0700 2006", 
      "id": 24, 
      "rating": 5.0, 
      "review": "I loved this book when I was growing up. I used to dream that someday I would live in Switzerland! Such a sweet story.", 
      "spoiler_flag": "false", 
      "user": "Elizabeth"
    }, 
    {
      "book_id": 103, 
      "date_added": "Tue Aug 29 11:44:38 -0700 2006", 
      "id": 25, 
      "rating": 4.0, 
      "review": null, 
      "spoiler_flag": "false", 
      "user": "Otis Chandler"
    }, 
    {
      "book_id": 105, 
      "date_added": "Tue Aug 29 11:44:48 -0700 2006", 
      "id": 26, 
      "rating": 4.0, 
      "review": null, 
      "spoiler_flag": "false", 
      "user": "Otis Chandler"
    }, 
    {
      "book_id": 106, 
      "date_added": "Tue Aug 29 11:44:56 -0700 2006", 
      "id": 27, 
      "rating": 4.0, 
      "review": null, 
      "spoiler_flag": "false", 
      "user": "Otis Chandler"
    }, 
    {
      "book_id": 1022863, 
      "date_added": "Tue Aug 29 11:45:04 -0700 2006", 
      "id": 28, 
      "rating": 5.0, 
      "review": "When people ask me what my favorite book is, Dune is always my answer. Words cannot even do justice to what an epic tale this is. We learn about spirituality, human nature, politics, religion, and the making of a hero.<br /><br />I loved the spiritual aspects of the book the best. The philosophies and practi...", 
      "spoiler_flag": "false", 
      "user": "Otis Chandler"
    }, 
    {
      "book_id": 112, 
      "date_added": "Tue Aug 29 11:45:24 -0700 2006", 
      "id": 29, 
      "rating": 4.0, 
      "review": null, 
      "spoiler_flag": "false", 
      "user": "Otis Chandler"
    }, 
    {
      "book_id": 117, 
      "date_added": "Tue Aug 29 11:47:10 -0700 2006", 
      "id": 30, 
      "rating": 4.0, 
      "review": null, 
      "spoiler_flag": "false", 
      "user": "Otis Chandler"
    }
  ], 
  "series_i": [
    {
      "author_id": null, 
      "count": 16, 
      "description": "Each book in the series is (mostly) a whole story with a beginning and an end; however, the plot (and characters) of every book relies <i><b>very</b></i> heavily on the prior books in the series.\n    \n    Series also known as:\n    <i>* Guida galattica per gli autostoppisti</i> [Italian]\n    <i>* Štoparski vodnik po Galaksiji</i> [Slovenian]\n    <i>* Guía del autoestopista galáctico</i> [Spanish]</i>\n    <i>* Пътеводител на галактическия стопаджия</i> [Bulgarian]</i>\n    <i>* Le Guide du voyageur galactique</i> [French]\n    <i>* Linnunrata</i> [Finnish]\n    <i>* Otostopçunun Galaksi Rehberi</i> [Turkish]\n    <i>* Guia dos Mochileiros da Galáxia</i> [Brazilian Portuguese]\n    <i>* Per Anhalter durch die Galaxis</i> [German]\n    <i>* Het Transgalactisch liftershandboek</i> [Dutch]\n    <i>* Stopárov sprievodca galaxiou</i> [Slovak]", 
      "id": 40957, 
      "series_name": "Hitchhiker's Guide to the Galaxy"
    }, 
    {
      "author_id": null, 
      "count": 13, 
      "description": "Orphan Harry learns he is a wizard on his 11th birthday when Hagrid escorts him to magic-teaching Hogwarts School. As a baby, his mother's love protected him and vanquished the villain Voldemort, leaving the child famous as \"The Boy who Lived\". With his friends Hermione and Ron, Harry has to defeat the returned \"One Who Must Not Be Named\".", 
      "id": 45175, 
      "series_name": "Harry Potter"
    }, 
    {
      "author_id": null, 
      "count": 3, 
      "description": "This series contains the two Heidi novels written by Johanna Spyri.\n    See also the <b><a href=\"https://www.goodreads.com/series/161104-heidi-sequel\">series of Heidi sequels</a></b>  written by French translator Charles Tritten.\n    \n    Heidi is originally published in two parts as <i>Heidi: her years of wandering and learning</i> (German: <i>Heidis Lehr- und Wanderjahre</i>) and <i>Heidi : How she used what she learned</i> (German: <i>Heidi kann brauchen, was es gelernt hat</i>).", 
      "id": 49698, 
      "series_name": "Heidi"
    }, 
    {
      "author_id": null, 
      "count": 18, 
      "description": null, 
      "id": 50296, 
      "series_name": "Starship Troopers RPG"
    }, 
    {
      "author_id": null, 
      "count": 3, 
      "description": null, 
      "id": 58307, 
      "series_name": "Gerald Samper"
    }, 
    {
      "author_id": null, 
      "count": 8, 
      "description": null, 
      "id": 62223, 
      "series_name": "Brian's Saga"
    }, 
    {
      "author_id": null, 
      "count": 3, 
      "description": null, 
      "id": 64314, 
      "series_name": "Game"
    }
  ]
}
