{
    "book": [
        {
            "book_id" : 0,
            "title" : "The Way of Kings",
            "cover_art" : "the_way_of_kings_cover_art.jpg",
            "author" : 0,
            "series" : 0,
            "reviews": [0],
            "description": "Speak again the ancient oaths, Strength before weakness. Journey before Destination. And return to men the Shards they once bore. The Knights Radiant must stand again. Roshar is a world of stone swept by tempests that shape ecology and civilization. Animals and plants retract; cities are built in shelter. In centuries since ten orders of Knights fell, their Shardblade swords and Shardplate armor still transform men into near-invincible warriors. Wars are fought for them, and won by them. In one such war on the ruined Shattered Plains, slave Kaladin struggles to save his men and fathom leaders who deem them expendable, in senseless wars where ten armies fight separately against one foe. Brightlord Dalinar Kholin commands one of those other armies. Fascinated by the ancient text namedThe Way of Kings and troubled by visions of ancient times, he doubts his sanity. Across the ocean, Shallan trains under eminent scholar and notorious heretic, Dalinar’s niece Jasnah. Though Shallan genuinely loves learning, she plans a daring theft. Her research hints at secrets of the Knights Radiant and the true cause of the war."
        },
        {
            "book_id" : 1,
            "title" : "Harry Potter and the Sorcerer's Stone",
            "cover_art" : "hp_book1.jpg",
            "author" : 1,
            "series" : 1,
            "reviews": [1],
            "description": "Harry Potter's life is miserable. His parents are dead and he's stuck with his heartless relatives, who force him to live in a tiny closet under the stairs. But his fortune changes when he receives a letter that tells him the truth about himself: he's a wizard. A mysterious visitor rescues him from his relatives and takes him to his new home, Hogwarts School of Witchcraft and Wizardry. After a lifetime of bottling up his magical powers, Harry finally feels like a normal kid. But even within the Wizarding community, he is special. He is the boy who lived: the only person to have ever survived a killing curse inflicted by the evil Lord Voldemort, who launched a brutal takeover of the Wizarding world, only to vanish after failing to kill Harry. Though Harry's first year at Hogwarts is the best of his life, not everything is perfect. There is a dangerous secret object hidden within the castle walls, and Harry believes it's his responsibility to prevent it from falling into evil hands. But doing so will bring him into contact with forces more terrifying than he ever could have imagined. Full of sympathetic characters, wildly imaginative situations, and countless exciting details, the first installment in the series assembles an unforgettable magical world and sets the stage for many high-stakes adventures to come"
        },
        {
            "book_id" : 2,
            "title" : "The Bad Beginning",
            "cover_art" : "the_bad_beginning.jpg",
            "author" : 2,
            "series" : 2,
            "reviews": [2],
            "description": "I'm sorry to say that the book you are holding in your hands is extremely unpleasant. It tells an unhappy tale about three very unlucky children. Even though they are charming and clever, the Baudelaire siblings lead lives filled with misery and woe. From the very first page of this book when the children are at the beach and receive terrible news, continuing on through the entire story, disaster lurks at their heels. One might say they are magnets for misfortune. In this short book alone, the three youngsters encounter a greedy and repulsive villain, itchy clothing, a disastrous fire, a plot to steal their fortune, and cold porridge for breakfast. It is my sad duty to write down these unpleasant tales, but there is nothing stopping you from putting this book down at once and reading something happy, if you prefer that sort of thing. With all due respect, Lemony Snicket"
        },

        {
            "book_id" : 3,
            "title" : "The Hunger Games",
            "cover_art" : "hunger_games.jpg",
            "author" : 3,
            "series" : 3,
            "reviews": [3]
        }
    ],
    "author": [
        {
            "author_id" : 0,
            "name" : "Brandon Sanderson",
            "books" : [0],
            "description" : "Brandon Sanderson (born December 19, 1975) is an American fantasy and science fiction writer. He is best known for the Cosmere universe, in which all his adult fantasy books (most notably the Mistborn series and The Stormlight Archive) are set; and his work in finishing Robert Jordan's epic fantasy series The Wheel of Time. Sanderson was raised in Lincoln, Nebraska before attending Brigham Young University, where he received degrees in English literature and creative writing. In 2008 Sanderson started a podcast with author Dan Wells and cartoonist Howard Tayler called Writing Excuses, involving topics about creating and producing genre writing and webcomics.",
            "genres" : ["Science Fiction & Fantasy", "Young Adult"],
            "series" : [0],
            "author_art" : "brandon.jpg",
            "twitter" : "BrandSanderson",
            "author_reviews" : [0]
        },
        {
            "author_id" : 1,
            "name" : "J.K. Rowling",
            "books" : [1],
            "description" : "Born in Yate, England, on July 31, 1965, J.K. Rowling came from humble economic means before writing Harry Potter and the Sorcerer's Stone, a children's fantasy novel. The work was an international hit and Rowling wrote six more books in the series, which sold hundreds of millions of copies and was adapted into a blockbuster film franchise. In 2012, Rowling released the novel The Casual Vacancy.",
            "genres" : ["Fantasy", "Young Adult", "Fiction"],
            "series" : [1],
            "author_art" : "rowling.jpg",
            "twitter" : "jk_rowling",
            "author_reviews" : [1]
        } ,
        {
            "author_id" : 2,
            "name" : "Lemony Snicket",
            "books" : [2],
            "description" : "Born Daniel Handler on February 28, 1970, in San Francisco, California, Lemony Snicket became well-known for his series of novels for children, A Series of Unfortunate Events, featuring the Baudelaire siblings, Violet, Klaus and Sunny. Books in the series include The Bad Beginning (1999), The Vile Village (2001), The Slippery Slope (2003), The Grim Grotto (2004), The Penultimate Peril (2005) and The End (2006). A film, Lemony Snicket's A Series of Unfortunate Events, directed by Brad Silberling, appeared in 2004.",
            "genres" : ["Children", "Fiction"],
            "series" : [2],
            "author_art" : "lemony_snicket.jpg",
            "twitter" : "lemonysnicket",
            "author_reviews" : [2]
        }
    ],
    "series_i": [
        {
            "series_id" : 0,
            "title" : "The Stormlight Archive",
            "books" : [0],
            "author" : 0,
            "count" : "1",
            "start" : "2010",
            "end" : "Ongoing",
            "series_art" : "stormlight_series.png"
        },
        {
            "series_id" : 1,
            "title" : "Harry Potter",
            "books" : [1],
            "author" : 1,
            "count" : "7",
            "start" : "September 1, 1998",
            "end" : "July 21, 2007",
            "series_art" : "harrypotter.jpg"
        },
        {
            "series_id" : 2,
            "title" : "A Series of Unfortunate Events",
            "books" : [2],
            "author" : 2,
            "count" : "13",
            "start" : "September 30, 1999",
            "end" : "October 13, 2006",
            "series_art" : "unfortunate_events.jpg"
        }
    ],
    "review": [
        {
            "review_id" : 0,
            "user" : "Patrick",
            "rating" : 5.0,
            "book" : 0,
            "book_title" : "The Way of Kings",
            "author" : 0,
            "text" : "I got to read an ARC of the book and I really enjoyed it. Sanderson really knows how tell a story and create an interesting world...."
        },
        {
            "review_id" : 1,
            "user" : "Kat O'Keeffe",
            "rating" : 5.0,
            "book" : 1,
            "book_title" : "Harry Potter and the Sorcerer's Stone",
            "author" : 1,
            "text" : "IT'S HARRY FREAKIN POTTER OF COURSE I LOVE IT\n\n*reread in March 2017 (for the first time in like 5 years)(STILL WONDERFUL)"
        },
        {
            "review_id" : 2,
            "user" : "Catriona (LittleBookOwl)",
            "rating" : 4.0,
            "book" : 2,
            "book_title" : "A Bad Beginning",
            "author" : 2,
            "text" : "For some reason I had the sudden urge to re-read these books... so I decided to..."
        }
    ]
}
